# Упражнение 1

## *Следните задачи да се решат рекурсивно*

## Задача 1
Напишете функция, която намира сумата на всички прости числа в масив с размер n.
```
Input:
    arr -> {5, 12, 432, 7, 23, 45}
    n   -> 6

Output:
    35
```

## Задача 2
Напишете функция, която да намира n-тото число на фибоначи.
```
Input:
    n -> 8
Output: 
    21
```

## Задача 3
Напишете функция, която да изписва всички възможни n мерни двуични числа, подредени по големина.
```
Input:
    n -> 4
Ouput:
    0000
    0001
    0010
     ...
    1101
    1110
    1111
```

## Задача 4
Да се напише функция, която проверява дали даден символен низ е палиндром.
